coocox/Mplib/Toshaba/TMPM36x/TMPM369/cmsis_lib/lib/cmsis_boot/startup/coide/startup_coide.c
//*****************************************************************************
//
//! \file startup_coide.c
//! \brief TMPM369 Devices Startup code for CooCox CoIDE.
//!        This module performs:
//!           - Set the initial SP
//!           - Set the vector table entries with the exceptions ISR address
//!           - Initialize data and bss
//!           - Setup the microcontroller system.
//!           - Call the application's entry point.
//!           .
//! \version V2.1.1.0
//! \date 5/8/2013
//! \author CooCox
//! \copy
//!
//! Copyright (c)  2013, CooCox
//! All rights reserved.
//!
//! Redistribution and use in source and binary forms, with or without
//! modification, are permitted provided that the following conditions
//! are met:
//!
//!     * Redistributions of source code must retain the above copyright
//! notice, this list of conditions and the following disclaimer.
//!     * Redistributions in binary form must reproduce the above copyright
//! notice, this list of conditions and the following disclaimer in the
//! documentation and/or other materials provided with the distribution.
//!     * Neither the name of the <ORGANIZATION> nor the names of its
//! contributors may be used to endorse or promote products derived
//! from this software without specific prior written permission.
//!
//! THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
//! AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
//! IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
//! ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
//! LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
//! CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
//! SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
//! INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
//! CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
//! ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
//! THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

//*****************************************************************************
//
// Stack Configuration
//
//*****************************************************************************
//
// Stack size (in Words)
//
#define STACK_SIZE       0x00000200
__attribute__ ((section(".co_stack")))
unsigned long pulStack[STACK_SIZE];

#define WEAK __attribute__ ((weak))

//*****************************************************************************
//
// Declaration of the default fault handlers
//
//*****************************************************************************
void WEAK  ResetHandler           (void);
void WEAK  NMIIntHandler          (void);
void WEAK  HardFaultIntHandler    (void);
void WEAK  MemManageIntHandler    (void);
void WEAK  BusFaultIntHandler     (void);
void WEAK  UsageFaultIntHandler   (void);
void WEAK  SVCIntHandler          (void);
void WEAK  DebugMonIntHandler     (void);
void WEAK  PendSVIntHandler       (void);
void WEAK  SysTickIntHandler      (void);


// External Interrupts
void WEAK  INT0_IRQHandler        (void);   //0:   Interrupt pin 0
void WEAK  INT1_IRQHandler        (void);   //1:   Interrupt pin 1
void WEAK  INT2_IRQHandler        (void);   //2:   Interrupt pin 2
void WEAK  INT3_IRQHandler        (void);   //3:   Interrupt pin 3
void WEAK  INT4_IRQHandler        (void);   //4:   Interrupt pin 4
void WEAK  INT5_IRQHandler        (void);   //5:   Interrupt pin 5
void WEAK  INT6_IRQHandler        (void);   //6:   Interrupt pin 6
void WEAK  INT7_IRQHandler        (void);   //7:   Interrupt pin 7
void WEAK  INT8_IRQHandler        (void);   //8:   Interrupt pin 8
void WEAK  INT9_IRQHandler        (void);   //9:   Interrupt pin 9
void WEAK  INTA_IRQHandler        (void);   //10:  Interrupt pin A
void WEAK  INTB_IRQHandler        (void);   //11:  Interrupt pin B
void WEAK  INTC_IRQHandler        (void);   //12:  Interrupt pin C
void WEAK  INTD_IRQHandler        (void);   //13:  Interrupt pin D
void WEAK  INTE_IRQHandler        (void);   //14:  Interrupt pin E
void WEAK  INTF_IRQHandler        (void);   //15:  Interrupt pin F
void WEAK  INTRX0_IRQHandler      (void);   //16:  Serial reception (channel.0)
void WEAK  INTTX0_IRQHandler      (void);   //17:  Serial transmission (channel.0)
void WEAK  INTRX1_IRQHandler      (void);   //18:  Serial reception (channel.1)
void WEAK  INTTX1_IRQHandler      (void);   //19:  Serial transmission (channel.1)
void WEAK  INTRX2_IRQHandler      (void);   //20:  Serial reception (channel.2)
void WEAK  INTTX2_IRQHandler      (void);   //21:  Serial transmission (channel.2)
void WEAK  INTRX3_IRQHandler      (void);   //22:  Serial reception (channel.3)
void WEAK  INTTX3_IRQHandler      (void);   //23:  Serial transmission (channel.3)
void WEAK  INTUART4_IRQHandler    (void);   //24:  FULL UART(channel.4)
void WEAK  INTUART5_IRQHandler    (void);   //25:  FULL UART(channel.5)
void WEAK  INTSBI0_IRQHandler     (void);   //26:  Serial bus interface 0
void WEAK  INTSBI1_IRQHandler     (void);   //27:  Serial bus interface 1
void WEAK  INTSBI2_IRQHandler     (void);   //28:  Serial bus interface 2
void WEAK  INTSSP0_IRQHandler     (void);   //29:  SPI serial interface 0
void WEAK  INTSSP1_IRQHandler     (void);   //30:  SPI serial interface 1
void WEAK  INTSSP2_IRQHandler     (void);   //31:  SPI serial interface 2
void WEAK  INTUSBH_IRQHandler     (void);   //32:  USB Host Interrupt
void WEAK  INTUSBD_IRQHandler     (void);   //33:  USB Device Interrupt
void WEAK  INTUSBWKUP_IRQHandler  (void);   //34:  USB WakeUp
void WEAK  INTCANRX_IRQHandler    (void);   //35:  CAN RX
void WEAK  INTCANTX_IRQHandler    (void);   //36:  CAN TX
void WEAK  INTCANGB_IRQHandler    (void);   //37:  CAN STAUTS
void WEAK  INTETH_IRQHandler      (void);   //38:  EtherNET Interrupt
void WEAK  INTETHWK_IRQHandler    (void);   //39:  EtherNET(magic packet detection) interrupt
void WEAK  INTADAHP_IRQHandler    (void);   //40:  Highest priority AD conversion complete interrupt (channel.A)
void WEAK  INTADAM0_IRQHandler    (void);   //41:  AD conversion monitoring function interrupt 0(channel.A)
void WEAK  INTADAM1_IRQHandler    (void);   //42:  AD conversion monitoring function interrupt 1(channel.A)
void WEAK  INTADA_IRQHandler      (void);   //43:  AD conversion interrupt(channel.A)
void WEAK  INTADBHP_IRQHandler    (void);   //44:  Highest priority AD conversion complete interrupt (channel.B)
void WEAK  INTADBM0_IRQHandler    (void);   //45:  AD conversion monitoring function interrupt 0(channel.B)
void WEAK  INTADBM1_IRQHandler    (void);   //46:  AD conversion monitoring function interrupt 1(channel.B)
void WEAK  INTADB_IRQHandler      (void);   //47:  AD conversion interrupt(channel.B)
void WEAK  INTEMG0_IRQHandler     (void);   //48:  PMD0 EMG interrupt (MPT0)
void WEAK  INTPMD0_IRQHandler     (void);   //49:  PMD0 PWM interrupt (MPT0)
void WEAK  INTENC0_IRQHandler     (void);   //50:  PMD0 Encoder input interrupt (MPT0)
void WEAK  INTEMG1_IRQHandler     (void);   //51:  PMD1 EMG interrupt (MPT1)
void WEAK  INTPMD1_IRQHandler     (void);   //52:  PMD1 PWM interrupt (MPT1)
void WEAK  INTENC1_IRQHandler     (void);   //53:  PMD1 Encoder input interrupt (MPT1)
void WEAK  INTMTEMG0_IRQHandler   (void);   //54:  16-bit MPT0 IGBT EMG interrupt
void WEAK  INTMTPTB00_IRQHandler  (void);   //55:  16-bit MPT0 IGBT period/ TMRB compare match detection 0
void WEAK  INTMTTTB01_IRQHandler  (void);   //56:  16-bit MPT0 IGBT trigger/ TMRB compare match detection 1
void WEAK  INTMTCAP00_IRQHandler  (void);   //57:  16-bit MPT0 input capture 0
void WEAK  INTMTCAP01_IRQHandler  (void);   //58:  16-bit MPT0 input capture 1
void WEAK  INTMTEMG1_IRQHandler   (void);   //59:  16-bit MPT1 IGBT EMG interrupt
void WEAK  INTMTPTB10_IRQHandler  (void);   //60:  16-bit MPT1 IGBT period/ TMRB compare match detection 0
void WEAK  INTMTTTB11_IRQHandler  (void);   //61:  16-bit MPT1 IGBT trigger/ TMRB compare match detection 1
void WEAK  INTMTCAP10_IRQHandler  (void);   //62:  16-bit MPT1 input capture 0
void WEAK  INTMTCAP11_IRQHandler  (void);   //63:  16-bit MPT1 input capture 1
void WEAK  INTMTEMG2_IRQHandler   (void);   //64:  16-bit MPT2 IGBT EMG interrupt
void WEAK  INTMTPTB20_IRQHandler  (void);   //65:  16-bit MPT2 IGBT period/ TMRB compare match detection 0
void WEAK  INTMTTTB21_IRQHandler  (void);   //66:  16-bit MPT2 IGBT trigger/ TMRB compare match detection 1
void WEAK  INTMTCAP20_IRQHandler  (void);   //67:  16-bit MPT2 input capture 0
void WEAK  INTMTCAP21_IRQHandler  (void);   //68:  16-bit MPT2 input capture 1
void WEAK  INTMTEMG3_IRQHandler   (void);   //69:  16-bit MPT3 IGBT EMG interrupt
void WEAK  INTMTPTB30_IRQHandler  (void);   //70:  16-bit MPT3 IGBT period/ TMRB compare match detection 0
void WEAK  INTMTTTB31_IRQHandler  (void);   //71:  16-bit MPT3 IGBT trigger/ TMRB compare match detection 1
void WEAK  INTMTCAP30_IRQHandler  (void);   //72:  16-bit MPT3 input capture 0
void WEAK  INTMTCAP31_IRQHandler  (void);   //73:  16-bit MPT3 input capture 1
void WEAK  INTRMCRX_IRQHandler    (void);   //74:  Remote Controller reception interrupt
void WEAK  INTTB0_IRQHandler      (void);   //75:  16-bit TMRB_0 match detection 0
void WEAK  INTCAP00_IRQHandler    (void);   //76:  16-bit TMRB_0 input capture 00
void WEAK  INTCAP01_IRQHandler    (void);   //77:  16-bit TMRB_0 input capture 01
void WEAK  INTTB1_IRQHandler      (void);   //78:  16-bit TMRB_1 match detection 1
void WEAK  INTCAP10_IRQHandler    (void);   //79:  16-bit TMRB_1 input capture 10
void WEAK  INTCAP11_IRQHandler    (void);   //80:  16-bit TMRB_1 input capture 11
void WEAK  INTTB2_IRQHandler      (void);   //81:  16-bit TMRB_2 match detection 2
void WEAK  INTCAP20_IRQHandler    (void);   //82:  16-bit TMRB_2 input capture 20
void WEAK  INTCAP21_IRQHandler    (void);   //83:  16-bit TMRB_2 input capture 21
void WEAK  INTTB3_IRQHandler      (void);   //84:  16-bit TMRB_3 match detection 3
void WEAK  INTCAP30_IRQHandler    (void);   //85:  16-bit TMRB_3 input capture 30
void WEAK  INTCAP31_IRQHandler    (void);   //86:  16-bit TMRB_3 input capture 31
void WEAK  INTTB4_IRQHandler      (void);   //87:  16-bit TMRB_4 match detection 4
void WEAK  INTCAP40_IRQHandler    (void);   //88:  16-bit TMRB_4 input capture 40
void WEAK  INTCAP41_IRQHandler    (void);   //89:  16-bit TMRB_4 input capture 41
void WEAK  INTTB5_IRQHandler      (void);   //90:  16-bit TMRB_5 match detection 5
void WEAK  INTCAP50_IRQHandler    (void);   //91:  16-bit TMRB_5 input capture 50
void WEAK  INTCAP51_IRQHandler    (void);   //92:  16-bit TMRB_5 input capture 51
void WEAK  INTTB6_IRQHandler      (void);   //93:  16-bit TMRB_6 match detection 6
void WEAK  INTCAP60_IRQHandler    (void);   //94:  16-bit TMRB_6 input capture 60
void WEAK  INTCAP61_IRQHandler    (void);   //95:  16-bit TMRB_6 input capture 61
void WEAK  INTTB7_IRQHandler      (void);   //96:  16-bit TMRB_7 match detection 7
void WEAK  INTCAP70_IRQHandler    (void);   //97:  16-bit TMRB_7 input capture 70
void WEAK  INTCAP71_IRQHandler    (void);   //98:  16-bit TMRB_7 input capture 71
void WEAK  INTRTC_IRQHandler      (void);   //99:  RTC(Real time clock) interrupt
void WEAK  INTDMAADA_IRQHandler   (void);   //100: DMA_ADC_A conversion end
void WEAK  INTDMAADB_IRQHandler   (void);   //101: DMA_ADC_B conversion end
void WEAK  INTDMADAA_IRQHandler   (void);   //102: DMA_DAC_A conversion trigger
void WEAK  INTDMADAB_IRQHandler   (void);   //103: DMA_DAC_B conversion trigger
void WEAK  INTDMASPR0_IRQHandler  (void);   //104: DMA_SSP_0 reception / DMA_I2C SIO_0
void WEAK  INTDMASPT0_IRQHandler  (void);   //105: DMA_SSP_0 transmission
void WEAK  INTDMASPR1_IRQHandler  (void);   //106: DMA_SSP_1 reception
void WEAK  INTDMASPT1_IRQHandler  (void);   //107: DMA_SSP_1 transmission
void WEAK  INTDMASPR2_IRQHandler  (void);   //108: DMA_SSP_2 reception
void WEAK  INTDMASPT2_IRQHandler  (void);   //109: DMA_SSP_2 transmission
void WEAK  INTDMAUTR4_IRQHandler  (void);   //110: DMA_FUART_4 reception
void WEAK  INTDMAUTT4_IRQHandler  (void);   //111: DMA_FUART_4 transmission
void WEAK  INTDMAUTR5_IRQHandler  (void);   //112: DMA_FUART_5 reception
void WEAK  INTDMAUTT5_IRQHandler  (void);   //113: DMA_FUART_5 transmission
void WEAK  INTDMARX0_IRQHandler   (void);   //114: DMA_SIO/ UART_0 reception
void WEAK  INTDMATX0_IRQHandler   (void);   //115: DMA_SIO/ UART_0 transmission
void WEAK  INTDMARX1_IRQHandler   (void);   //116: DMA_SIO/ UART_1 reception
void WEAK  INTDMATX1_IRQHandler   (void);   //117: DMA_SIO/ UART_1 transmission
void WEAK  INTDMARX2_IRQHandler   (void);   //118: DMA_SIO/ UART_2 reception
void WEAK  INTDMATX2_IRQHandler   (void);   //119: DMA_SIO/ UART_2 transmission
void WEAK  INTDMARX3_IRQHandler   (void);   //120: DMA_SIO/ UART_3 reception
void WEAK  INTDMATX3_IRQHandler   (void);   //121: DMA_SIO/ UART_3 transmission
void WEAK  INTDMASBI1_IRQHandler  (void);   //122: DMA_I2C/ SIO_1
void WEAK  INTDMASBI2_IRQHandler  (void);   //123: DMA_I2C/ SIO_2
void WEAK  INTDMATB_IRQHandler    (void);   //124: 16-bit TMRB_0-4 match detection
void WEAK  INTDMARQ_IRQHandler    (void);   //125: DMA request pin
void WEAK  INTDMAAERR_IRQHandler  (void);   //126: DMA_A error transfer interrupt
void WEAK  INTDMABERR_IRQHandler  (void);   //127: DMA_B error transfer interrupt

//*****************************************************************************
//
// Symbols defined in linker script
//
//*****************************************************************************
//
// Start address for the initialization values of the .data section.
//
extern unsigned long _sidata;

//
// Start address for the .data section
//
extern unsigned long _sdata;

//
// End address for the .data section
//
extern unsigned long _edata;

//
// Start address for the .bss section
//
extern unsigned long _sbss;

//
// End address for the .bss section
//
extern unsigned long _ebss;

//
// End address for ram
//
extern void _eram;

//*****************************************************************************
//
// Function prototypes
//
//*****************************************************************************
extern int main(void);
extern void SystemInit(void);
__attribute__ ((used))
void ResetHandler(void);
static void DefaultIntHandler(void);

//
// The minimal vector table for a Cortex M3.  Note that the proper constructs
// must be placed on this to ensure that it ends up at physical address
// 0x00000000.
//
__attribute__ ((used,section(".isr_vector")))
void (* const g_pfnVectors[])(void) =
{
    (void *)&pulStack[STACK_SIZE], // The initial stack pointer
    ResetHandler                 , // The reset handler
    NMIIntHandler                , // The NMI handler
    HardFaultIntHandler          , // The hard fault handler
    MemManageIntHandler          , // The MPU fault handler
    BusFaultIntHandler           , // The bus fault handler
    UsageFaultIntHandler         , // The usage fault handler
    0                            , // Reserved
    0                            , // Reserved
    0                            , // Reserved
    0                            , // Reserved
    SVCIntHandler                , // SVCall handler
    DebugMonIntHandler           , // Debug monitor handler
    0                            , // Reserved
    PendSVIntHandler             , // The PendSV handler
    SysTickIntHandler            , // The SysTick handler

